Repository: MeseCraft/MeseCraft
Catalog: mods/ITEMS/drawers/locale/*.po
Languages: id

source: Current State:
id: Keadaan Saat Ini:

source: Stopped
id: Berhenti

source: Running
id: Berjalan

source: Jammed
id: Macet

source: Drawer Controller
id: Pengendali Laci

source: Empty
id: Kosong

source: Wooden
id: Kayu

source: @1 Drawer
id: Laci @1

source: @1 Drawers (1x2)
id: Laci @1 (1x2)

source: @1 Drawers (2x2)
id: Laci @1 (2x2)

source: @1 (@2% full)
id: @1 (@2% penuh)

source: @1 @2 (@3% full)
id: @1 @2 (@3% penuh)

source: Acacia Wood
id: Kayu Akasia

source: Aspen Wood
id: Kayu Aspen

source: Junglewood
id: Kayu Rimba

source: Pine Wood
id: Kayu Pinus

source: Oak Wood
id: Kayu Ek

source: Birch Wood
id: Kayu Birch

source: Dark Oak Wood
id: Kayu Ek Gelap

source: Spruce Wood
id: Kayu Cemara

source: Steel Drawer Upgrade (x2)
id: Tingkatkan menjadi Laci Baja (x2)

source: Gold Drawer Upgrade (x3)
id: Tingkatkan menjadi Laci Emas (x3)

source: Obsidian Drawer Upgrade (x5)
id: Tingkatkan menjadi Laci Obsidian (x5)

source: Diamond Drawer Upgrade (x8)
id: Tingkatkan menjadi Laci Berlian (x8)

source: Iron Drawer Upgrade (x2)
id: Tingkatkan menjadi Laci Besi (x2)

source: Emerald Drawer Upgrade (x13)
id: Tingkatkan menjadi Laci Zamrud (x13)

source: Wooden Trim
id: Ukiran Kayu

source: Drawer Upgrade Template
id: Templat Peningkatan Laci
