Repository: MeseCraft/MeseCraft
Catalog: mods/crops/locale/*.po
Languages: de, es

source: Unbaked clay bowl
de: Ungebackene Lehmschale
es: Tazón de arcilla sin cocer

source: Clay bowl
de: Lehmschale
es: Tazón de arcilla

source: Bowl of vegetable stew
de: Schale voll Gemseeintopf
es: Tazón de sopa de vegetales

source: Bowl of uncooked vegetable stew
de: Schale voll mit roher Gemseeintopf
es: Tazón de sopa de vegetales sin cocer

source: Corn
de: Mais
es: Maíz

source: Corn Cob
de: Maiskolben
es: Elote

source: Corn on the Cob
de: Gebackener Maiskolben
es: Maíz en mazorca

source: Corn plant
de: Maispflanze
es: Planta de maíz

source: Defaulting to "normal" difficulty settings
de: Benutze standard Schwierigkeitsgrad "normal"
es: Se usará la dificultad "normal" por defecto

source: Hydration and dehydration mechanics are enabled.
de: Hydrierungs- und Dehydrierungsmechaniken sind aktiviert.
es: Mecánica de hidratación y deshidratación activada.

source: Unable to find plant "@1" in crops table
es: No se pudo encontrar la planta "@1" en la tabla de cosechas

source: Loaded!
es: ¡Cargado!

source: Melon seed
de: Melonensamen
es: Semilla de sandía

source: Melon plant
de: Melonenpflanze
es: Planta de sandía

source: Melon slice
de: Melonenscheibe
es: Trozo de sandía

source: Melon
de: Melone
es: Sandía

source: Green Bean
de: Grne Bohne
es: Frijol verde

source: Beanpoles
de: Bohnenstangen
es: Poste para frijoles

source: Green bean seed
de: Samen einer Grnen Bohne
es: Semilla de frijoles verdes

source: Green Bean plant
de: Grne Bohnenpflanze
es: Planta de frijoles verdes

source: Potato eyes
de: Kartoffelaugen
es: Ojos de patata

source: Potato plant
de: Kartoffelpflanze
es: Planta de patata

source: Potato
de: Kartoffel
es: Patata

source: Soil with potatoes
de: Acker mit Kartoffeln
es: Suelo con patatas

source: Pumpkin seed
de: Krbissamen
es: Semillas de calabaza

source: Pumpkin plant
de: Krbispflanze
es: Planta de calabaza

source: Roasted pumpkin
de: Gersteter Krbis
es: Calabaza asada

source: Pumpkin
de: Krbis
es: Calabaza

source: Tomato seed
de: Tomatensamen
es: Semilla de tomate

source: Tomato plant
de: Tomatenpflanze
es: Planta de tomate

source: Tomato
de: Tomate
es: Tomate

source: Watering Can
de: Giekanne
es: Regadera

source: Hydrometer
es: Hidrómetro
