Repository: MeseCraft/MeseCraft
Catalog: mods/drawers/locale/*.po
Languages: cs, de, it, pl

source: Current State:
de: Momentaner Zustand:
pl: Stan aktulany:

source: Stopped
de: Angehalten
pl: Zatrzymany

source: Running
de: Läuft
pl: Uruchomiona

source: Jammed
de: Gestaut
pl: Zablokowany

source: Drawer Controller
de: Schubfach Steuerung
pl: Kontroler szuflady

source: Empty
cs: Prázdný
de: Leer
it: Vuoto
pl: Pusta

source: Wooden
cs: ze dřeva
de: Holz
it: Di legno
pl: Drewniany

source: @1 Drawer
cs: Šuplík @1
de: @1schubfach
it: @1 Cassetto
pl: @1 Szuflada

source: @1 Drawers (1x2)
cs: Šuplíky @1 (1x2)
de: @1schubfächer (1×2)
it: @1 Cassetti (1x2)
pl: @1 Szuflady (1x2)

source: @1 Drawers (2x2)
cs: Šuplíky @1 (2x2)
de: @1schubfächer (2×2)
it: @1 Cassetti (2x2)
pl: @1 Szuflady (2x2)

source: @1 (@2% full)
cs: @1 (z @2 % plný)
de: @1 (@2% voll)
it: @1 (@2% pieno)
pl: @1 (@2% napełnione)

source: @1 @2 (@3% full)
cs: @1 @2 (z @3 % plný)
de: @1 @2 (@3% voll)
it: @1 @2 (@3% pieno)
pl: @1 @2 (@3% napełnione)

source: Acacia Wood
cs: ze dřeva akácie
de: Akazienholz
it: Legno di acacia
pl: Drewno akacjowe

source: Aspen Wood
cs: ze dřeva osiky
de: Espenholz
it: Legno di pioppo
pl: Drewno osikowe

source: Junglewood
cs: ze dřeva džunglovníku
de: Tropenholz
it: Legno della giungla
pl: Drewno jungli

source: Pine Wood
cs: ze borovicového dřeva
de: Kiefernholz
it: Legno di pino
pl: Drewno sosnowe

source: Oak Wood
cs: ze dubového dřeva
de: Eichenholz
it: Legno di quercia
pl: Drewno dębowe

source: Birch Wood
cs: z bukového dřeva
de: Birkenholz
it: Legno di betulla
pl: Drewno brzozowe

source: Dark Oak Wood
cs: z tmavého dubového dřeva
de: Dunkeleichenholz
it: Legno di quercia scura
pl: Drewno ciemne dębowe

source: Spruce Wood
cs: ze smrkového dřeva
de: Fichtenholz
it: Legno di abete rosso
pl: Drwno świerkowe

source: Steel Drawer Upgrade (x2)
cs: Ocelové vylepšení šuplíku (x2)
de: Stahl-Schubfachverbesserung (×2)
it: Miglioramento d'acciaio della cassettiera (x2)
pl: Ulepszenie stalowej szuflady(x2)

source: Gold Drawer Upgrade (x3)
cs: Zlaté vylepšení šuplíku (x3)
de: Gold-Schubfachverbesserung (×3)
it: Miglioramento d'oro della cassettiera (x3)
pl: Ulepszenie złotej szuflady (x3)

source: Obsidian Drawer Upgrade (x5)
cs: Obsidiánové vylepšení šuplíku (x5)
de: Obsidian-Schubfachverbesserung (×5)
it: Miglioramento d'ossidiana della cassettiera (x5)
pl: Ulepszenie obsydianowej szuflady (x5)

source: Diamond Drawer Upgrade (x8)
cs: Diamantové vylepšení šuplíku (x8)
de: Diamant-Schubfachverbesserung (×8)
it: Miglioramento di diamante della cassettiera (x8)
pl: Ulepszenie diamentowej szuflady (x8)

source: Iron Drawer Upgrade (x2)
cs: Železné vylepšení šuplíku (x2)
de: Eisen-Schubfachverbesserung (×2)
it: Miglioramento di ferro della cassettiera (x3)
pl: Żelazna aktualizacja szuflady (x2)

source: Emerald Drawer Upgrade (x13)
cs: Emeraldové vylepšení šuplíku (x13)
de: Smaragd-Schubfachverbesserung (×13)
it: Miglioramento di smeraldo della cassettiera (x13)
pl: Ulepszenie szmaragdowej szuflady (x13)

source: Wooden Trim
de: Holzverkleidung

source: Drawer Upgrade Template
cs: Šablona vylepšení šuplíku
de: Schubfachverbesserungsvorlage
it: Modello di miglioramento della cassettiera
